const provinces = ["ยะลา", "ปัตตานี", "นราธิวาส"];

const policeStations = {
            "ปัตตานี": [
              "สถานีตำรวจภูธรเมืองปัตตานี",
              "สถานีตำรวจภูธรโคกโพธิ์",
              "สถานีตำรวจภูธรหนองจิก",
              "สถานีตำรวจภูธรยะหริ่ง",
              "สถานีตำรวจภูธรปะนาเระ",
              "สถานีตำรวจภูธรสายบุรี",
              "สถานีตำรวจภูธรไม้แก่น",
              "สถานีตำรวจภูธรแม่ลาน",
              "สถานีตำรวจภูธรทุ่งยางแดง",
              "สถานีตำรวจภูธรมายอ",
              "สถานีตำรวจภูธรยะรัง",
              "สถานีตำรวจภูธรกะพ้อ",
              "สถานีตำรวจภูธรเจาะไอร้อง"
            ],
            "ยะลา": [
              "สถานีตำรวจภูธรเมืองยะลา",
              "สถานีตำรวจภูธรกรงปินัง",
              "สถานีตำรวจภูธรยะหา",
              "สถานีตำรวจภูธรรามัน",
              "สถานีตำรวจภูธรกาบัง",
              "สถานีตำรวจภูธรธารโต",
              "สถานีตำรวจภูธรบันนังสตา",
              "สถานีตำรวจภูธรเบตง",
              "สถานีตำรวจภูธรลำใหม่"
            ],
            "นราธิวาส": [
              "สถานีตำรวจภูธรเมืองนราธิวาส",
              "สถานีตำรวจภูธรตากใบ",
              "สถานีตำรวจภูธรบาเจาะ",
              "สถานีตำรวจภูธรยี่งอ",
              "สถานีตำรวจภูธรรือเสาะ",
              "สถานีตำรวจภูธรแว้ง",
              "สถานีตำรวจภูธรสุไหงโก-ลก",
              "สถานีตำรวจภูธรสุไหงปาดี",
              "สถานีตำรวจภูธรระแงะ",
              "สถานีตำรวจภูธรศรีสาคร",
              "สถานีตำรวจภูธรจะแนะ",
              "สถานีตำรวจภูธรสุคิริน",
              "สถานีตำรวจภูธรเฉลิมพระเกียรติ"
            ]
          };

          const distincts = {
            "ปัตตานี": [
              "อำเภอเมืองปัตตานี",
              "อำเภอโคกโพธิ์",
              "อำเภอหนองจิก",
              "อำเภอยะหริ่ง",
              "อำเภอปะนาเระ",
              "อำเภอสายบุรี",
              "อำเภอไม้แก่น",
              "อำเภอแม่ลาน",
              "อำเภอทุ่งยางแดง",
              "อำเภอมายอ",
              "อำเภอยะรัง"
            ],
            "ยะลา": [
              "อำเภอเมืองยะลา",
              "อำเภอเบตง",
              "อำเภอบันนังสตา",
              "อำเภอธารโต",
              "อำเภอยะหา",
              "อำเภอกรงปินัง",
              "อำเภอรามัน",
              "อำเภอกาบัง"
            ],
            "นราธิวาส": [
              "อำเภอเมืองนราธิวาส",
              "อำเภอสุไหงโก-ลก",
              "อำเภอสุไหงปาดี",
              "อำเภอระแงะ",
              "อำเภอรือเสาะ",
              "อำเภอศรีสาคร",
              "อำเภอแว้ง",
              "อำเภอสุคิริน",
              "อำเภอจะแนะ",
              "อำเภอเจาะไอร้อง"
            ]
          };
